app/controllers/contact_us_controller.rb

  def index
    @contact_us = ContactUs.all
---
SELECT * FROM "contact_us"

  def show
    @contact_us = ContactUs.find(params[:id])
---
SELECT * FROM "contact_us" WHERE ("contact_us"."id" = 0)

  def create
    @contact_us = ContactUs.new(params[:contact_us])
    if @contact_us.save
---
INSERT INTO "contact_us" ("name", "company", "updated_at", "porject", "email", "created_at") VALUES('darren holland', 'nivieo solutions', '2010-01-13 05:14:40', 'this shit is the wackest', 'hollanddd@gmail.com', '2010-01-13 05:14:40')